Realiza una exploración inicial de los datos para identificar posibles problemas, como valores nulos, atípicos o datos faltantes en las columnas relevantes.

In [3]:
# Import libraries for data processing
# -----------------------------------------------------------------------
import pandas as pd  # Pandas for data manipulation and analysis in Python.

# Optional libraries (can be removed if not used):
# -----------------------------------------------------------------------
# Import libraries for web scraping and data manipulation
# from bs4 import BeautifulSoup
# import requests

# Import libraries for web browser automation with Selenium
# from selenium import webdriver
# from webdriver_manager.chrome import ChromeDriverManager

# ChromeDriverManager manages the installation of the Chrome driver

# from selenium.webdriver.common.keys import Keys  # Keys is useful for simulating keyboard events in Selenium.
# from selenium.webdriver.support.ui import Select  # Select is used to interact with <select> elements on web pages.

# Import libraries for pausing execution
# -----------------------------------------------------------------------
# from time import sleep  # Sleep is used to pause the program execution for a number of seconds.

# Configurations
# -----------------------------------------------------------------------
pd.set_option('display.max_columns', None)  # Set a Pandas option to show all columns of a DataFrame.

import warnings
warnings.filterwarnings("ignore")
warnings.simplefilter(action='ignore', category=FutureWarning)

pd.options.display.max_columns = None

pd.set_option('display.float_format', '{:.2f}'.format)

In [2]:
# Load the two datasets into separate DataFrames
activity = pd.read_csv("files/Customer Flight Activity.csv")
loyalty = pd.read_csv("files/Customer Loyalty History.csv")

In [29]:
# Creation of a function to explore the DataFrames
def explore_df(df):
    """
    This function allows to make an initial data exploration. 

    Args:
      df (pandas.DataFrame): The DataFrame to explore. Refering to the ones previously opened. 

    Returns:
      None  
      """
    # Prints information about the DataFrame
    print("The main information for DataFrame is: ")
    df.info()
    print("______________________")
    # Print the first 5 rows of the DataFrame
    print(f"The first 5 rows for DataFrame are:")
    display(df.head())

In [30]:
explore_df(activity)

The main information for DataFrame is:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 405624 entries, 0 to 405623
Data columns (total 10 columns):
 #   Column                       Non-Null Count   Dtype
---  ------                       --------------   -----
 0   Loyalty Number               405624 non-null  int64
 1   Year                         405624 non-null  int64
 2   Month                        405624 non-null  int64
 3   Flights Booked               405624 non-null  int64
 4   Flights with Companions      405624 non-null  int64
 5   Total Flights                405624 non-null  int64
 6   Distance                     405624 non-null  int64
 7   Points Accumulated           405624 non-null  float64
 8   Points Redeemed              405624 non-null  int64
 9   Dollar Cost Points Redeemed  405624 non-null  int64
dtypes: float64(1), int64(9)
memory usage: 30.9 MB
______________________
The first 5 rows for DataFrame are:

,Loyalty Number,Year,Month,Flights Booked,Flights with Companions,Total Flights,Distance,Points Accumulated,Points Redeemed,Dollar Cost Points Redeemed
0,100018,2017,1,3,0,3,1521,152.00,0,0
1,100102,2017,1,10,4,14,2030,203.00,0,0
2,100140,2017,1,6,0,6,1200,120.00,0,0
3,100214,2017,1,0,0,0,0,0.00,0,0
4,100272,2017,1,0,0,0,0,0.00,0,0

In [32]:
explore_df(loyalty)

The main information for DataFrame is:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16737 entries, 0 to 16736
Data columns (total 16 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Loyalty Number      16737 non-null  int64
 1   Country             16737 non-null  object
 2   Province            16737 non-null  object
 3   City                16737 non-null  object
 4   Postal Code         16737 non-null  object
 5   Gender              16737 non-null  object
 6   Education           16737 non-null  object
 7   Salary              12499 non-null  float64
 8   Marital Status      16737 non-null  object
 9   Loyalty Card        16737 non-null  object
 10  CLV                 16737 non-null  float64
 11  Enrollment Type     16737 non-null  object
 12  Enrollment Year     16737 non-null  int64
 13  Enrollment Month    16737 non-null  int64
 14  Cancellation Year   2067 non-null   float64
 15  Cancellation Month  2067 non-null   float64
dtypes: float64(4), int64(3), object(9)
memory usage: 2.0+ MB
______________________
The first 5 rows for DataFrame are:

,Loyalty Number,Country,Province,City,Postal Code,Gender,Education,Salary,Marital Status,Loyalty Card,CLV,Enrollment Type,Enrollment Year,Enrollment Month,Cancellation Year,Cancellation Month
0,480934,Canada,Ontario,Toronto,M2Z 4K1,Female,Bachelor,83236.00,Married,Star,3839.14,Standard,2016,2,NaN,NaN
1,549612,Canada,Alberta,Edmonton,T3G 6Y6,Male,College,NaN,Divorced,Star,3839.61,Standard,2016,3,NaN,NaN
2,429460,Canada,British Columbia,Vancouver,V6E 3D9,Male,College,NaN,Single,Star,3839.75,Standard,2014,7,2018.00,1.00
3,608370,Canada,Ontario,Toronto,P1W 1K4,Male,College,NaN,Single,Star,3839.75,Standard,2013,2,NaN,NaN
4,530508,Canada,Quebec,Hull,J8Y 3Z5,Male,Bachelor,103495.00,Married,Star,3842.79,Standard,2014,10,NaN,NaN

In [71]:
# Creation of a function to obtain further information
def df_information(df):
    #Prints the shape of the DataFrame 
    print(f"The shape for the DataFrame is: ")
    print(df.shape)
    print("_________________")
    #Prints the list of column names
    print(f"The name of the columns are: {list(df.columns)}")
    print("_________________")
    #Prints the nulls
    print(f"The number of nulls in the DataFrame:")
    print(df.isna().sum())
    print("_________________")
    #Prints the transposed descriptive statistics
    print(f"The descriptive statististcs for this DataFrame are:")
    display(df.describe().T)

In [72]:
df_information(activity)

The shape for the DataFrame is:
(405624, 10)
_________________
The name of the columns are: ['Loyalty Number', 'Year', 'Month', 'Flights Booked', 'Flights with Companions', 'Total Flights', 'Distance', 'Points Accumulated', 'Points Redeemed', 'Dollar Cost Points Redeemed']
_________________
The number of nulls in the DataFrame:
Loyalty Number                 0
Year                           0
Month                          0
Flights Booked                 0
Flights with Companions        0
Total Flights                  0
Distance                       0
Points Accumulated             0
Points Redeemed                0
Dollar Cost Points Redeemed    0
dtype: int64
_________________
The descriptive statististcs for this DataFrame are:

,count,mean,std,min,25%,50%,75%,max
Loyalty Number,405624.00,550037.87,258935.29,100018.00,326961.00,550834.00,772194.00,999986.00
Year,405624.00,2017.50,0.50,2017.00,2017.00,2017.50,2018.00,2018.00
Month,405624.00,6.50,3.45,1.00,3.75,6.50,9.25,12.00
Flights Booked,405624.00,4.12,5.23,0.00,0.00,1.00,8.00,21.00
Flights with Companions,405624.00,1.03,2.08,0.00,0.00,0.00,1.00,11.00
Total Flights,405624.00,5.15,6.52,0.00,0.00,1.00,10.00,32.00
Distance,405624.00,1208.88,1433.16,0.00,0.00,488.00,2336.00,6293.00
Points Accumulated,405624.00,123.69,146.60,0.00,0.00,50.00,239.00,676.50
Points Redeemed,405624.00,30.70,125.49,0.00,0.00,0.00,0.00,876.00
Dollar Cost Points Redeemed,405624.00,2.48,10.15,0.00,0.00,0.00,0.00,71.00

In [69]:
df_information(loyalty)

The shape for the DataFrame is:
(16737, 16)
_________________
The name of the columns are: ['Loyalty Number', 'Country', 'Province', 'City', 'Postal Code', 'Gender', 'Education', 'Salary', 'Marital Status', 'Loyalty Card', 'CLV', 'Enrollment Type', 'Enrollment Year', 'Enrollment Month', 'Cancellation Year', 'Cancellation Month']
_________________
The number of nulls in the DataFrame:
Loyalty Number            0
Country                   0
Province                  0
City                      0
Postal Code               0
Gender                    0
Education                 0
Salary                 4238
Marital Status            0
Loyalty Card              0
CLV                       0
Enrollment Type           0
Enrollment Year           0
Enrollment Month          0
Cancellation Year     14670
Cancellation Month    14670
dtype: int64
_________________
The descriptive statististcs for this DataFrame are:

,count,mean,std,min,25%,50%,75%,max
Loyalty Number,16737.00,549735.88,258912.13,100018.00,326603.00,550434.00,772019.00,999986.00
Salary,12499.00,79245.61,35008.30,-58486.00,59246.50,73455.00,88517.50,407228.00
CLV,16737.00,7988.90,6860.98,1898.01,3980.84,5780.18,8940.58,83325.38
Enrollment Year,16737.00,2015.25,1.98,2012.00,2014.00,2015.00,2017.00,2018.00
Enrollment Month,16737.00,6.67,3.40,1.00,4.00,7.00,10.00,12.00
Cancellation Year,2067.00,2016.50,1.38,2013.00,2016.00,2017.00,2018.00,2018.00
Cancellation Month,2067.00,6.96,3.46,1.00,4.00,7.00,10.00,12.00

In [79]:
# Merges the both DataFrames
all = activity.merge(loyalty, how='inner', on= "Loyalty Number")

In [80]:
explore_df(all)

The main information for DataFrame is:
<class 'pandas.core.frame.DataFrame'>
Int64Index: 405624 entries, 0 to 405623
Data columns (total 25 columns):
 #   Column                       Non-Null Count   Dtype
---  ------                       --------------   -----
 0   Loyalty Number               405624 non-null  int64
 1   Year                         405624 non-null  int64
 2   Month                        405624 non-null  int64
 3   Flights Booked               405624 non-null  int64
 4   Flights with Companions      405624 non-null  int64
 5   Total Flights                405624 non-null  int64
 6   Distance                     405624 non-null  int64
 7   Points Accumulated           405624 non-null  float64
 8   Points Redeemed              405624 non-null  int64
 9   Dollar Cost Points Redeemed  405624 non-null  int64
 10  Country                      405624 non-null  object
 11  Province                     405624 non-null  object
 12  City                         405624 non-null  object
 13  Postal Code                  405624 non-null  object
 14  Gender                       405624 non-null  object
 15  Education                    405624 non-null  object
 16  Salary                       302952 non-null  float64
 17  Marital Status               405624 non-null  object
 18  Loyalty Card                 405624 non-null  object
 19  CLV                          405624 non-null  float64
 20  Enrollment Type              405624 non-null  object
 21  Enrollment Year              405624 non-null  int64
 22  Enrollment Month             405624 non-null  int64
 23  Cancellation Year            50064 non-null   float64
 24  Cancellation Month           50064 non-null   float64
dtypes: float64(5), int64(11), object(9)
memory usage: 80.5+ MB
______________________
The first 5 rows for DataFrame are:

,Loyalty Number,Year,Month,Flights Booked,Flights with Companions,Total Flights,Distance,Points Accumulated,Points Redeemed,Dollar Cost Points Redeemed,Country,Province,City,Postal Code,Gender,Education,Salary,Marital Status,Loyalty Card,CLV,Enrollment Type,Enrollment Year,Enrollment Month,Cancellation Year,Cancellation Month
0,100018,2017,1,3,0,3,1521,152.00,0,0,Canada,Alberta,Edmonton,T9G 1W3,Female,Bachelor,92552.00,Married,Aurora,7919.20,Standard,2016,8,NaN,NaN
1,100018,2017,2,2,2,4,1320,132.00,0,0,Canada,Alberta,Edmonton,T9G 1W3,Female,Bachelor,92552.00,Married,Aurora,7919.20,Standard,2016,8,NaN,NaN
2,100018,2018,10,6,4,10,3110,311.00,385,31,Canada,Alberta,Edmonton,T9G 1W3,Female,Bachelor,92552.00,Married,Aurora,7919.20,Standard,2016,8,NaN,NaN
3,100018,2017,4,4,0,4,924,92.00,0,0,Canada,Alberta,Edmonton,T9G 1W3,Female,Bachelor,92552.00,Married,Aurora,7919.20,Standard,2016,8,NaN,NaN
4,100018,2017,5,0,0,0,0,0.00,0,0,Canada,Alberta,Edmonton,T9G 1W3,Female,Bachelor,92552.00,Married,Aurora,7919.20,Standard,2016,8,NaN,NaN

In [81]:
df_information(all)

The shape for the DataFrame is:
(405624, 25)
_________________
The name of the columns are: ['Loyalty Number', 'Year', 'Month', 'Flights Booked', 'Flights with Companions', 'Total Flights', 'Distance', 'Points Accumulated', 'Points Redeemed', 'Dollar Cost Points Redeemed', 'Country', 'Province', 'City', 'Postal Code', 'Gender', 'Education', 'Salary', 'Marital Status', 'Loyalty Card', 'CLV', 'Enrollment Type', 'Enrollment Year', 'Enrollment Month', 'Cancellation Year', 'Cancellation Month']
_________________
The number of nulls in the DataFrame:
Loyalty Number                      0
Year                                0
Month                               0
Flights Booked                      0
Flights with Companions             0
Total Flights                       0
Distance                            0
Points Accumulated                  0
Points Redeemed                     0
Dollar Cost Points Redeemed         0
Country                             0
Province                            0
City                                0
Postal Code                         0
Gender                              0
Education                           0
Salary                         102672
Marital Status                      0
Loyalty Card                        0
CLV                                 0
Enrollment Type                     0
Enrollment Year                     0
Enrollment Month                    0
Cancellation Year              355560
Cancellation Month             355560
dtype: int64
_________________
The descriptive statististcs for this DataFrame are:

,count,mean,std,min,25%,50%,75%,max
Loyalty Number,405624.00,550037.87,258935.29,100018.00,326961.00,550834.00,772194.00,999986.00
Year,405624.00,2017.50,0.50,2017.00,2017.00,2017.50,2018.00,2018.00
Month,405624.00,6.50,3.45,1.00,3.75,6.50,9.25,12.00
Flights Booked,405624.00,4.12,5.23,0.00,0.00,1.00,8.00,21.00
Flights with Companions,405624.00,1.03,2.08,0.00,0.00,0.00,1.00,11.00
Total Flights,405624.00,5.15,6.52,0.00,0.00,1.00,10.00,32.00
Distance,405624.00,1208.88,1433.16,0.00,0.00,488.00,2336.00,6293.00
Points Accumulated,405624.00,123.69,146.60,0.00,0.00,50.00,239.00,676.50
Points Redeemed,405624.00,30.70,125.49,0.00,0.00,0.00,0.00,876.00
Dollar Cost Points Redeemed,405624.00,2.48,10.15,0.00,0.00,0.00,0.00,71.00
Salary,302952.00,79268.83,34992.13,-58486.00,59262.00,73479.00,88612.00,407228.00
CLV,405624.00,7991.98,6863.66,1898.01,3985.32,5776.34,8936.82,83325.38
Enrollment Year,405624.00,2015.25,1.98,2012.00,2014.00,2015.00,2017.00,2018.00
Enrollment Month,405624.00,6.67,3.40,1.00,4.00,7.00,10.00,12.00
Cancellation Year,50064.00,2016.50,1.38,2013.00,2016.00,2017.00,2018.00,2018.00
Cancellation Month,50064.00,6.97,3.45,1.00,4.00,7.00,10.00,12.00